Repository: sidali-dev/skycast
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Location updated
ar: تم تحديث الموقع

# weather_updated
source: Weather updated to current location
ar: تم تحديث الطقس للموقع الحالي

source: Location didn't change
ar: لم يتغير الموقع

source: You are in the same location
ar: أنت في نفس الموقع

source: Hourly Forecast
ar: التوقعات بالساعة

source: Upcoming Days
ar: الأيام القادمة

source: Weather Details
ar: تفاصيل الطقس

# percipitation
source: Precipitation
ar: هطول الأمطار

source: Wind
ar: الرياح

# km_per_hour
source: km/h
ar: كم/س

source: Humidity
ar: الرطوبة

source: mm
ar: مم

source: UV
ar: الأشعة فوق البنفسجية

source: Loading...
ar: جاري التحميل...

source: Location Permission Denied
ar: تم رفض إذن الموقع

source: Location Service Disabled
ar: خدمة الموقع معطلة

source: Error Getting Weather
ar: خطأ في الحصول على معلومات الطقس

source: Request Location Permission
ar: طلب إذن الموقع

source: Check Location Service
ar: تحقق من خدمة الموقع

source: Try Again
ar: حاول مرة أخرى

source: Search City
ar: البحث عن مدينة

source: Enter City Name
ar: أدخل اسم المدينة

source: Searching...
ar: جاري البحث...

source: No results found
ar: لم يتم العثور على نتائج

source: Tomorrow
ar: غداً

source: Hour Details
ar: تفاصيل الساعة

source: Select Language
ar: اختر اللغة

source: Sunny
ar: مشمس

source: Clear
ar: صافي

source: Partly Cloudy
ar: غائم جزئياً

source: Cloudy
ar: غائم

source: Overcast
ar: غائم تماماً

source: Mist
ar: ضباب خفيف

source: Patchy rain possible
ar: احتمالية أمطار متفرقة

source: Patchy snow possible
ar: احتمالية ثلوج متفرقة

source: Patchy sleet possible
ar: احتمالية جليد متفرق

source: Patchy freezing drizzle possible
ar: احتمالية رذاذ متجمد متفرق

source: Thundery outbreaks possible
ar: احتمالية عواصف رعدية

source: Blowing snow
ar: ثلوج متطايرة

source: Blizzard
ar: عاصفة ثلجية

source: Fog
ar: ضباب

source: Freezing fog
ar: ضباب متجمد

source: Patchy light drizzle
ar: رذاذ خفيف متفرق

source: Light drizzle
ar: رذاذ خفيف

source: Freezing drizzle
ar: رذاذ متجمد

source: Heavy freezing drizzle
ar: رذاذ متجمد غزير

source: Patchy light rain
ar: أمطار خفيفة متفرقة

source: Light rain
ar: أمطار خفيفة

source: Moderate rain at times
ar: أمطار معتدلة في بعض الأوقات

source: Moderate rain
ar: أمطار معتدلة

source: Heavy rain at times
ar: أمطار غزيرة في بعض الأوقات

source: Heavy rain
ar: أمطار غزيرة

source: Light freezing rain
ar: أمطار متجمدة خفيفة

source: Moderate or heavy freezing rain
ar: أمطار متجمدة معتدلة أو غزيرة

source: Light sleet
ar: جليد خفيف

source: Moderate or heavy sleet
ar: جليد معتدل أو غزير

source: Patchy light snow
ar: ثلوج خفيفة متفرقة

source: Light snow
ar: ثلوج خفيفة

source: Patchy moderate snow
ar: ثلوج معتدلة متفرقة

source: Moderate snow
ar: ثلوج معتدلة

source: Patchy heavy snow
ar: ثلوج غزيرة متفرقة

source: Heavy snow
ar: ثلوج غزيرة

source: Ice pellets
ar: حبات جليدية

source: Light rain shower
ar: زخات مطر خفيفة

source: Moderate or heavy rain shower
ar: زخات مطر معتدلة أو غزيرة

source: Torrential rain shower
ar: زخات مطر غزيرة جداً

source: Light sleet showers
ar: زخات جليد خفيفة

source: Moderate or heavy sleet showers
ar: زخات جليد معتدلة أو غزيرة

source: Light snow showers
ar: زخات ثلوج خفيفة

source: Moderate or heavy snow showers
ar: زخات ثلوج معتدلة أو غزيرة

source: Light showers of ice pellets
ar: زخات خفيفة من حبات الجليد

source: Moderate or heavy showers of ice pellets
ar: زخات معتدلة أو غزيرة من حبات الجليد

source: Patchy light rain with thunder
ar: أمطار خفيفة متفرقة مع رعد

source: Moderate or heavy rain with thunder
ar: أمطار معتدلة أو غزيرة مع رعد

source: Patchy light snow with thunder
ar: ثلوج خفيفة متفرقة مع رعد

source: Moderate or heavy snow with thunder
ar: ثلوج معتدلة أو غزيرة مع رعد
